app/views/students/_form.html.erb

    <%= f.label :mentor_id %><br>
    <%= f.select 'mentor_id', options_from_collection_for_select(Mentor.all, :id, :name),{}, {class: "form-control"} %>
---
SELECT "mentors".* FROM "mentors"