app/controllers/colleges_controller.rb

  def index
    #@colleges = College.all

    @colleges = College.all.paginate(:page => params[:page], :per_page => 30)
    @colleges = @colleges.where("name Like (?)", "%#{params["name"]}%") if params["name"].present?
---
SELECT  "colleges".* FROM "colleges" LIMIT 30 OFFSET 0
SELECT  "colleges".* FROM "colleges" WHERE "colleges"."name" = ? LIMIT 30 OFFSET 0  [["name", "Man"]]

  def create
    @college = College.new(college_params)

    respond_to do |format|
      if @college.save
---
INSERT INTO "colleges" ("name", "country", "tuition_fees", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "A University"], ["country", "WWW"], ["tuition_fees", 3333.0], ["created_at", "2015-03-15 08:57:59.234447"], ["updated_at", "2015-03-15 08:57:59.234447"]]

  def update
    respond_to do |format|
      if @college.update(college_params)
---
UPDATE "colleges" SET "name" = ?, "tuition_fees" = ?, "updated_at" = ? WHERE "colleges"."id" = ?  [["name", "C University"], ["tuition_fees", 20000.0], ["updated_at", "2015-03-15 08:56:05.741040"], ["id", 1]]

    def set_college
      @college = College.find(params[:id])
---
SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = ? LIMIT 1  [["id", 1]]