app/controllers/homes_controller.rb

SELECT "colleges".* FROM "colleges"
SELECT "students".* FROM "students" INNER JOIN "student_colleges" ON "students"."id" = "student_colleges"."student_id" WHERE "student_colleges"."college_id" = ?  [["college_id", 1]]
SELECT DISTINCT "colleges".* FROM "colleges" INNER JOIN "student_colleges" ON "student_colleges"."college_id" = "colleges"."id" INNER JOIN "students" ON "students"."id" = "student_colleges"."student_id" WHERE (colleges.name Like ('Manchester'))
SELECT "colleges".* FROM "colleges" INNER JOIN "student_colleges" ON "student_colleges"."college_id" = "colleges"."id" INNER JOIN "students" ON "students"."id" = "student_colleges"."student_id"
SELECT "students".* FROM "students" INNER JOIN "student_colleges" ON "student_colleges"."student_id" = "students"."id" INNER JOIN "colleges" ON "colleges"."id" = "student_colleges"."college_id"
---
  def index
  	colleges = College.all
	colleges = College.joins(:students).where("colleges.name Like (?)",params[:name]).uniq if params[:name].present?
    @temp_arr = []
	colleges.each do |college|