app/controllers/mentors_controller.rb

SELECT "mentors".* FROM "mentors"
---
  def index
    @mentors = Mentor.all

INSERT INTO "mentors" ("name", "age", "bio", "image", "dob", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "eaf"], ["age", 324], ["bio", "eaf"], ["image", ""], ["dob", "2015-03-15 05:39:00.000000"], ["created_at", "2015-03-15 05:39:36.585763"], ["updated_at", "2015-03-15 05:39:36.585763"]]
---
  def create
    @mentor = Mentor.new(mentor_params)

    respond_to do |format|
      if @mentor.save

UPDATE "mentors" SET "image" = ?, "updated_at" = ? WHERE "mentors"."id" = ?  [["image", "#<ActionDispatch::Http::UploadedFile:0x007f85e6bf2390>"], ["updated_at", "2015-03-16 06:04:51.500780"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @mentor.update(mentor_params)

DELETE FROM "mentors" WHERE "mentors"."id" = ?  [["id", 1]]
---
  def destroy
    @mentor.destroy

SELECT  "mentors".* FROM "mentors" WHERE "mentors"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_mentor
      @mentor = Mentor.find(params[:id])