app/controllers/students_controller.rb

  def destroy
    @student.destroy
    StudentCollege.where(:student_id=> @student.id).destroy_all
---
DELETE FROM "student_colleges" WHERE "student_colleges"."id" = ?  [["id", 2]]
SELECT "student_colleges".* FROM "student_colleges" WHERE "student_colleges"."student_id" = ?  [["student_id", 1]]