app/controllers/students_controller.rb

SELECT "colleges".* FROM "colleges"
---
  def new
    @student = Student.new
    @all_colleges= College.all

SELECT "colleges".* FROM "colleges"
---
  def edit
    @all_colleges= College.all

SELECT "colleges".* FROM "colleges"
INSERT INTO "student_colleges" ("student_id", "college_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", 28], ["college_id", 28], ["created_at", "2015-03-14 20:10:50.964553"], ["updated_at", "2015-03-14 20:10:50.964553"]]
INSERT INTO "students" ("name", "age", "current_school", "current_level", "country", "sat_score", "mentor_id", "dob", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @student = Student.new(student_params)
    college_params[:id].each do |college|
      if !college.empty?
        @student.student_colleges.build(:college_id=> college)
      end
    end
    @all_colleges= College.all
    @student_college = @student.student_colleges.build
    respond_to do |format|
      if @student.save

UPDATE "students" SET "name" = ?, "age" = ?, "current_school" = ?, "current_level" = ?, "country" = ?, "sat_score" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "BB"], ["age", 344], ["current_school", "f32432"], ["current_level", "323"], ["country", "fsdfe"], ["sat_score", 2132], ["updated_at", "2015-03-14 17:36:24.243366"], ["id", 2]]
DELETE FROM "student_colleges" WHERE "student_colleges"."student_id" = ? AND "student_colleges"."student_id" = ?  [["student_id", 2], ["student_id", 2]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "student_colleges" ("student_id", "college_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", 7], ["college_id", 3], ["created_at", "2015-03-15 09:46:12.790754"], ["updated_at", "2015-03-15 09:46:12.790754"]]
UPDATE "student_colleges" SET "college_id" = 1 WHERE "student_colleges"."student_id" = ? AND "student_colleges"."student_id" = ?  [["student_id", 2], ["student_id", 2]]
---
  def update

    respond_to do |format|
      if @student.update(student_params)
        @student.student_colleges.where(:student_id=> @student.id).delete_all
        college_params[:id].each do |college|
          if !college.empty?
            @student.student_colleges.new(:student_id=> @student.id, :college_id=> college).save

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
    #@student.destroy
    Student.where(:id=> @student.id).destroy_all