app/controllers/universities_controller.rb

  def index
    @universities = University.all.paginate(:page => params[:page], :per_page => 30)
    @universities = @universities.where(name: params["name"]) if params["name"].present?
    @universities = @universities.where(tuition_fees: params["tuition_fees"]) if params["tuition_fees"].present?
---
SELECT  "universities".* FROM "universities" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "universities"
SELECT  "universities".* FROM "universities" WHERE "universities"."name" = ? AND "universities"."name" = ? LIMIT 25 OFFSET 0  [["name", "Princeton"], ["name", "400"]]
SELECT  "universities".* FROM "universities" WHERE "universities"."name" = ? AND "universities"."tuition_fees" = ? LIMIT 30 OFFSET 0  [["name", "Princeton University"], ["tuition_fees", "41"]]